testdata/m4/runtime-context/expected-start.mmd
flowchart TD
  m_7fa4b09acb67["app.Base.run() [runtime: app.First]"]
  m_21f2f6fd30d0["app.Base.run() [runtime: app.Second]"]
  m_5242422cd94c["app.First.hook()"]
  m_8ba7271b2fba["app.Second.hook()"]
  m_0b3cef9ccfc2["app.Workflow.start(app.First,app.Second)"]
  m_7fa4b09acb67 --> m_5242422cd94c
  m_21f2f6fd30d0 --> m_8ba7271b2fba
  m_0b3cef9ccfc2 --> m_7fa4b09acb67
  m_0b3cef9ccfc2 --> m_21f2f6fd30d0
